{
  "title": "Портфолио",
  "tabs": {
    "all": "Все",
    "landings": "Визитки",
    "app": "Приложения",
    "cms": "CMS",
    "school": "RSS школа"
  },
  "project": "Посмотреть проект:",
  "responsive": "Отзывчивая верстка",
  "adaptive": "Адаптивная верстка",
  "fixed": "Фиксированная верстка",
  "mobile": "Мобильная верстка",
  "landing": "Сайт-визитка",
  "app": "Веб приложение",
  "constr": "Веб конструктор",
  "task": "Тех задание",
  "phptempl": "PHP шаблон",
  "shop": "Онлайн магазин",
  "forum": "Форум",
  "visit": "Открыть страницу",
  "features": "Особенности:",
  "library": "Библиотека",
  "link": "Ссылка",
  "more1": "Особенности: ...",
  "yandexGo": {
    "description": [
      "Yandex Go - одностраничный сайт-визитка (лэндинг), рекламирующий самокаты.",
      "Веб страница создана на базе платформы Editor X (продвинутая платформа-конструктор",
      "для разработки веб сайтов). Реализована адаптивная верстка с основными контрольными",
      "точками 1440px, 900px и 375px. Для небольших экранов блок с изображениями организован",
      "в слайдер, управляемый кнопками (он-клик эвенты на JS и Velo API)."
    ]
  },
  "yandexGoSASS": {
    "description": [
      "Yandex Go - одностраничный сайт-визитка (лэндинг), рекламирующий самокаты.",
      "Веб страница создана на базе HTML, SCSS и jQuery, опубликованная на GH-Pages.",
      "Реализована адаптивная верстка с основными контрольными точками 1440px, 900px",
      "и 375px. Для небольших экранов блок с изображениями организован в слайдер,",
      "управляемый кнопками (он-клик эвенты на jQuery)."
    ]
  },
  "zoo": {
    "description": [
      "Online Zoo - вебсайт, показывающий информацию о животных в разных зоопарках.",
      "Веб страница создана на базе HTML, SCSS и jQuery. Присутствуют интерактивные элементы,",
      "форма, анимированый скролл, и тд. Основные контрольные точки 1600px, 1000px and 640px."
    ]
  },
  "culturePortal": {
    "description": [
      "Culture Portal - мультиязыковой веб портал о культуре Беларуси, разработан в рамках",
      "командного проекта. Сайт сделан на базе React/redux библиотек, стилизован с",
      "использованием Material-UI компонентов. Локализация реализована с помощью React-intl",
      "библиотеки. Особенности: ..."
    ],
    "more": {
      "homePage": {
        "name": "Главная страница",
        "features": [
          {
            "name": "Контент представлен на 3 языках - Английский, Белорусский, Русский",
            "library": "react-intl"
          },
          {
            "name": "Стилизация компонентов",
            "library": "@material-ui"
          },
          {
            "name": "Анимированная навигация по странице",
            "library": "react-anchor-link-smooth-scroll"
          },
          {
            "name": "Анимированный слайдер на стартовом экране с таймером и автоплей функцией",
            "library": "slick-slider"
          },
          {
            "name": "Стилизованная галерея изображений",
            "library": "react-image-gallery"
          },
          {
            "name": "Календарь с Date-picker и функцией, меняющей контент в зависимости от выбранной даты",
            "library": "React"
          }
        ]
      },
      "persPage": {
        "name": "Страница фотографа",
        "features": [
          {
            "name": "Анимированный вертикальный скролл-хронология",
            "library": "vertical-timeline-component-for-react"
          },
          {
            "name": "Анимированная галерея изображений",
            "library": "slick-carousel"
          },
          {
            "name": "Видео-плеер для видеофайлов и видео с Youtube",
            "library": "video-react, react-youtube"
          },
          {
            "name": "Google Map API для отображения локаций на карте",
            "library": "google-maps-react"
          }
        ]
      },
      "allPers": {
        "name": "Страница всех фотографов",
        "features": [
          {
            "name": "Форма для поиска фотографа по имени и/или месту из списка фотографов",
            "library": "React"
          }
        ]
      }
    }
  },
  "chat": {
    "description": [
      "Awesome Chat - простое веб приложение на базе вебсокетов, сделано на React/redux,",
      "для стилизации использовались библиотеки Material-UI и Bootstrap. На сайте настроены",
      "пуш-уведомления, переключаемые свитч-кнопкой. Имеется текстовое поле для ввода контента",
      "(content-editable) и смайлы. Перед отправкой сообщения введенный контент форматируется",
      "в простой текст, смайлы заменяются на соответствующий им код. При получении сообщений,",
      "коды смайлов заменяются на элементы img. На странице есть простой логин блок, автозагрузка",
      "всех сообщений чата, отображение статуса вебсокета. Сайт публикуется автоматически на",
      "Render.com после каждого коммита в репозиторий проекта на Github."
    ]
  },
  "youtube": {
    "description": [
      "Youtube App - веб приложение, написанное на чистом JS, с JS манипуляцией DOM страницы,",
      "AJAX запросами, Youtube API, Babel, Webpack. В приложении реализован поиск среди контента",
      "YouTube по ключевым словам. Результат поиска представлен в виде каточек с детальной",
      "информацией о видеоклипе."
    ],
    "more": {
      "features": [
        "HTML разметка страницы полностью создается функцией JavaScript при загрузке страницы",
        "Результат поиска организован в бесконечный скролл-слайдер (на мобильных устройствах - тач скролл)",
        "Пагинация создается после получения первого фрагмента результата поискового запроса",
        "Респонсивная верстка страницы, при изменении ширины экрана происходит перерисовка слайдера и пагинации",
        "Youtube API использовано для поиска видеоклипов, по каждому клипу представлена информация: канал, дата, просмотры, описание, ссылка на видео"
      ]
    }
  },
  "fesco": {
    "description": [
      "Restaurant Fesco - одностраничный сайт-визитка (лэндинг), отображающий информацию о ресторане.",
      "Веб страница создана на базе HTML, SCSS и JavaScript. На странице есть стилизованная панель",
      "навигации, адаптированная под настольный компьютер и мобильные устройства. Имеется форма для",
      "бронирования столика со стилизованными селект-полями и календарем с date-picker (js-datepicker библиотека)."
    ]
  },
  "piskel": {
    "description": [
      "Piskel Clone - упрощенный клон Piskel - веб инструмента для создания анимированных спрайтов",
      "и пиксельной графики. Веб приложение создано на базе библиотек React/redux, с использованием",
      "Google API, базы данных Firebase, Canvas элемента для отрисовки графики и анимаций через скрипты JS."
    ],
    "more": {
      "google": {
        "name": "Google API",
        "features": [
          {
            "name": "Для регистрации и авторизации использовано Google Auth API, on success промис возвращает данные Google юзера"
          },
          {
            "name": "Спрайты могут быть сохранены на Google drive пользователя, ссылки на спрайт будут сгенерированны"
          }
        ]
      },
      "canvas": {
        "name": "Canvas API",
        "features": [
          {
            "name": "Все анимированные спрайты созданы на базе Canvas API и функций на JavaScript (jQuery), сторонние библиотеки не использовались"
          },
          {
            "name": "Основные инструменты рисования: кисть, линия, прямоугольник, круг, ведро (заливка), ластик"
          },
          {
            "name": "Для инструмента Пипетка написана функция для сравнения взятого по пикселю цвета с текущим цветом"
          },
          {
            "name": "Имеется простая цветовая палитра из текущего и предыдущего цвета, которые можно переключать между собой"
          },
          {
            "name": "Слева имеется блок Кадров, можно создавать новые, копировать, удалять или переставлять кадры"
          },
          {
            "name": "Справа блок содержит настройки слоев, FPS и палитры использованых цветов"
          },
          {
            "name": "Боковая слайдер-панель содержит настройки канваса и опции экспорта/импорта спрайтов"
          }
        ]
      },
      "store": {
        "name": "Опции сохранения спрайтов",
        "features": [
          {
            "name": "После авторизации, все сохраненные анимации запрашиваются из базы данных FireBase и отображаются в Галерее Пользователя"
          },
          {
            "name": "Если пользователь сохраняет анимацию в свою галерею, то запись добавляется в БД FireBase"
          },
          {
            "name": "При удалении анимации из галереи, она будет удалена из БД FireBase"
          },
          {
            "name": "Пользователи могут сохранить анимацию в своем Google drive аккаунте"
          },
          {
            "name": "Можно сохранять анимации локально в браузере (LocalStorage), список локальных спрайтов открывается в pop-up окне"
          },
          {
            "name": "Файл с анимацией можно скачать в формате gif (библиотека GIFEncoder)"
          }
        ]
      },
      "user": {
        "name": "Страница пользователя",
        "features": [
          {
            "name": "В веб приложении имеется простая страница пользователя, с базовой информацией о пользователе, Галереей и страницей Спрайта"
          },
          {
            "name": "В галерее отображены все сохраненные анимации в виде карточек с информацией и кнопками действий, спрайты анимированы согласно их настройкам"
          },
          {
            "name": "Кнопки действий позволяют удалять, изменять или копировать спрайт, а также получить детальную информацию на странице Спрайта"
          },
          {
            "name": "При нажатии на кнопки Изменить или Копировать спрайт, откроется канвас с этим спрайтом и его настройками (количество кадров, их контент, FPS, палитра, и тд)"
          }
        ]
      }
    }
  },
  "alexis": {
    "description": [
      "Alexis - одностраничный сайт-визитка (лэндинг), подходящий для компании или портфолио.",
      "Реализована полностью отзывчивая верстка, панель навигации адаптирована под настольный",
      "компьютер и мобильные устройства. Имеется анимированный слайдер для отзывов, блок участников",
      "проекта имеет эффект slide-in при клике по блоку. Присутствуют другие onHover и onClick эффекты"
    ]
  },
  "hexal": {
    "description": [
      "Hexal - одностраничный сайт-визитка (лэндинг), продукт дизайнерского эксперимента",
      "с гексагонами и простой анимацией. Веб страница создана на базе HTML и CSS, имеет",
      "простую фиксированную верстку. Гексагоны организованы в грид-разметку, с запуском",
      "анимации при onHover эвенте. Имеется форма с валидацией вводимых данных."
    ]
  },
  "gofuck": {
    "description": [
      "GoFuckBiz.com - Форум успешных вебмастеров. Основной задачей было создать файл стилей (wireless CSS)",
      "для PHP шаблонизатора под мобильные устройства. На странице сделана стилизованная пагинация,",
      "несколько форм, разные виды сообщений (цитаты, фрагменты кода, изображения, текст и тд), счетчики,",
      "кнопки реакций (лайки, ответить, цитировать)."
    ]
  },
  "gritella": {
    "description": [
      "Gritella lingerie - онлайн магазин, сделанный на платформе WordPress с использованием WooCommerce плагина.",
      "Контент можно менять на сайте в панели админа (CMS). Данные хранятся в БД MySQL."
    ],
    "warning": [
      "Проект был закрыт в августе 2021, сайт опубликован на бесплатном хостинге, некоторый функционал",
      "недоступен (отсутствует SSL, не работают капчи, логин через гугл/соц сети, и другие API)"
    ],
    "more": {
      "homePage": {
        "name": "Главная страница",
        "link": {
          "url": "http://d97714j6.beget.tech/",
          "title": "Открыть страницу"
        },
        "features": [
          {
            "name": "В хедер блоке отображены контакты, иконки Личного кабинета, счетчики корзины и отложенных товаров."
          },
          {
            "name": "Главный баннер содержит фирменный логотип и панель поиска по товарам"
          },
          {
            "name": "Панель навигации имеет выпадающий список товаров (Max Mega Menu plugin)"
          },
          {
            "name": "Товары расположены в грид-сетке с функцией сортировки, кнопками действий на карточке товара"
          },
          {
            "name": "Добавлена форма для подписки на рекламную рассылку (\"Mailchimp for WooCommerce\" plugin)"
          },
          {
            "name": "Справа панель навигации на страницу Пользователя, Отложенных товаров и Корзину"
          }
        ]
      },
      "productPage": {
        "name": "Страница товара",
        "link": {
          "url": "http://d97714j6.beget.tech/catalog/anil-5526/",
          "title": "Открыть страницу"
        },
        "features": [
          {
            "name": "Изображения товаров организованы в галерею"
          },
          {
            "name": "Имеется баннер с рейтингом покупателей"
          },
          {
            "name": "Выбор размера товара"
          },
          {
            "name": "Добавление товара в корзину/отложенные"
          },
          {
            "name": "Поделиться через соцсети"
          },
          {
            "name": "Блок с вкладками: описание товара, изображения, отзывы"
          }
        ]
      },
      "userPage": {
        "name": "Страница пользователя",
        "link": {
          "url": "http://d97714j6.beget.tech/profile/",
          "title": "Открыть страницу"
        },
        "features": [
          {
            "name": "Регистрация/логин с Email и паролем, или используя сторонние сервисы (FB, VK, Google)"
          },
          {
            "name": "Стилизованная панель навигации на Главную страницу, Заказы, Доставки, Возвраты, Адреса"
          },
          {
            "name": "Отображена основная информация о пользователе: ФИО, Контакты, Аватар, доставки, и тд"
          },
          {
            "name": "Если оформлен заказ, то показана ближайшая дата доставки"
          }
        ]
      },
      "gift": {
        "name": "Страница подарочной карты",
        "link": {
          "url": "http://d97714j6.beget.tech/about-giftcard/",
          "title": "Открыть страницу"
        },
        "features": [
          {
            "name": "Покупатели могут купить и подарить виртуальную подарочную карту разного номинала"
          },
          {
            "name": "Подарочная карта с сопроводительным текстом отправляется получателю на указанный Email"
          },
          {
            "name": "Владельцы подарочной карты могут применить код при оплате товаров в Магазине"
          },
          {
            "name": "Есть форма для проверки баланса Подарочной Карты по номеру карты или телефона"
          }
        ]
      },
      "order": {
        "name": "Страница заказа/корзина",
        "link": {
          "url": "http://d97714j6.beget.tech/order/",
          "title": "Открыть страницу"
        },
        "features": [
          {
            "name": "Товар в корзине отображен в таблице с кнопками действий (удалить, изменить количество, ссылка на товар)"
          },
          {
            "name": "При оформлении заказа есть возможность авторизоваться/зарегистрироваться, ввести Купон, Подарочную карту, войти через соц аккаунт"
          },
          {
            "name": "Выбор метода доставки (СДЭК плагин, интеграция СДЭК API с подсчетом стоимости и сроков доставки)"
          },
          {
            "name": "Получение полного адреса и почтового индекса для курьерской доставки происходит с помощью Yadex Map API, отображение постаматов СДЭК на карте"
          },
          {
            "name": "Форма с валидацией ввода данных покупателя"
          },
          {
            "name": "Переход на страницу платежной платформы, после оплаты чек и детали заказа отправляются на Email"
          },
          {
            "name": "Заказ падает в личный кабинет, на общей странице пользователя отобразится дата ближайшей доставки"
          },
          {
            "name": "Платежная система работает в рамках Федерального закона № 54 \"О применении контрольно-кассовой техники при осуществлении расчетов в РФ\""
          }
        ]
      },
      "misc": {
        "name": "Разное",
        "type": "Ссылка",
        "features": [
          {
            "name": "Установены и модифицированы плагины (ATUM Inventory Management for WooCommerce, Jetpack, UpdraftPlus - Backup/Restore, Mailchimp etc)",
            "link": true
          },
          {
            "name": "Разработана SEO кампания с применением различных инструментов (Метатэги, Open Graph, Google Analytix, Yandex Webmaster, All in One SEO addon for WordPress)",
            "link": {
              "href": "https://github.com/AlexSkir/gritella-lingerie/blob/main/assets/images/yandex.png",
              "name": "Смотреть скриншот"
            }
          },
          {
            "name": "Применены эффективые SEO решения для отображения контента в поисковой выдаче",
            "link": {
              "href": "https://github.com/AlexSkir/gritella-lingerie/blob/main/assets/images/1.jpg",
              "name": "Смотреть скриншот"
            }
          },
          {
            "name": "Настроены Email уведомления клиентов и владельца магазина",
            "link": {
              "href": "https://github.com/AlexSkir/gritella-lingerie/blob/main/assets/images/5_2.jpg",
              "name": "Смотреть скриншот"
            }
          },
          {
            "name": "Создана страница FAQs со стилизованной боковой панелью навигации, таблицей со сворачиваемыми элементами",
            "link": {
              "href": "https://github.com/AlexSkir/gritella-lingerie/blob/main/assets/images/FAQs.png",
              "name": "Смотреть скриншот"
            }
          },
          {
            "name": "Написаны PHP функции для кастомизации плагинов и добавления дополнительного функционала",
            "link": {
              "href": "https://github.com/AlexSkir/gritella-lingerie/blob/main/assets/PHP/functions.php",
              "name": "Образец кода"
            }
          },
          {
            "name": "CSS кастомизация Темы магазина",
            "link": {
              "href": "https://github.com/AlexSkir/gritella-lingerie/blob/main/assets/CSS/custom.css",
              "name": "Образец кода"
            }
          },
          {
            "name": "CSS стилизация элементов в PHP файлах",
            "link": {
              "href": "https://github.com/AlexSkir/gritella-lingerie/blob/main/assets/PHP/email-styles.php",
              "name": "Образец кода"
            }
          },
          {
            "name": "Написаны JS скрипты для интеграции СДЭК Delivery API",
            "link": {
              "href": "https://github.com/AlexSkir/gritella-lingerie/blob/main/assets/JS/delivery-calc.js",
              "name": "Образец кода"
            }
          },
          {
            "name": "Delivery API - выбор способа доставки и отображения постаматов на карте",
            "link": {
              "href": "https://github.com/AlexSkir/gritella-lingerie/blob/main/assets/images/yandexmap.jpg",
              "name": "Смотреть скриншот"
            }
          },
          {
            "name": "Delivery API - цена доставки рассчитана и добавлена в корзину",
            "link": {
              "href": "https://github.com/AlexSkir/gritella-lingerie/blob/main/assets/images/4.jpg",
              "name": "Смотреть скриншот"
            }
          },
          {
            "name": "Личный кабинет",
            "link": {
              "href": "https://github.com/AlexSkir/gritella-lingerie/blob/main/assets/images/profile.jpg",
              "name": "Смотреть скриншот"
            }
          }
        ]
      }
    }
  }
}